---
kind: method
id: M:Autodesk.Revit.DB.XYZ.ToString
zh: 点
source: html/634eeb2a-2ca8-7950-8b79-6cfdc4f1ba73.htm
---
# Autodesk.Revit.DB.XYZ.ToString Method

**中文**: 点

Gets formatted string showing (X, Y, Z) with values formatted to 9 decimal places.

## Syntax (C#)
```csharp
public override string ToString()
```